Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/distutils.tmx
Source language: en
Languages: fr

source: API Reference
fr: Référence de l'API

source: The :mod:`distutils.core` module is the only module that needs to be installed to use the Distutils. It provides the :func:`setup` (which is called from the setup script). Indirectly provides the :class:`distutils.dist.Distribution` and :class:`distutils.cmd.Command` class.
fr: Le module :mod:`distutils.core` est le seul module qui a besoin d'être installé pour utiliser Distutils. Il fournit le :func:`setup` (qui est appelé par le script de setup). Il fournit indirectement les classes :class:`distutils.dist.Distribution` et :class:`distutils.cmd.Command`.

source: The basic do-everything function that does most everything you could ever ask for from a Distutils method. See XXXXX
fr: La fonction de base à tout faire qui fait presque tout ce dont vous pourriez attendre d'une méthode Distutils. Voir XXXXX

source: The setup function takes a large number of arguments. These are laid out in the following table.
fr: La fonction setup prend un grand nombre d'arguments. Ils sont présentés dans le tableau suivant.

source: argument name
fr: nom de l'argument

source: value
fr: valeur

source: The name of the package
fr: Le nom du paquet

source: a string
fr: une chaîne de caractères

source: The version number of the package
fr: Le numéro de version du paquet

source: See :mod:`distutils.version`
fr: Voir :mod:`distutils.version`

source: A single line describing the package
fr: Une ligne unique décrivant le paquet

source: Longer description of the package
fr: Une description plus longue du paquet

source: The name of the package author
fr: Le nom de l'auteur du paquet

source: The email address of the package author
fr: L'adresse e-mail de l'auteur du paquet

source: The name of the current maintainer, if different from the author
fr: Le nom du mainteneur actuel, si différent de l'auteur

source: The email address of the current maintainer, if different from the author
fr: L'adresse email de l'actuel mainteneur, si différent de l'auteur

source: A URL for the package (homepage)
fr: Une URL pour le paquet (page d'accueil)

source: a URL
fr: une URL

source: A URL to download the package
fr: Une URL pour télécharger le paquet

source: A list of Python packages that distutils will manipulate
fr: Une liste des paquets Python que distutils va manipuler

source: a list of strings
fr: une liste de chaînes

source: A list of Python modules that distutils will manipulate
fr: Une liste de modules Python que distutils va manipuler

source: A list of standalone script files to be built and installed
fr: Une liste de scripts autonomes à construire et à installer

source: A list of Python extensions to be built
fr: Une liste des extensions Python à construire

source: A list of instances of :class:`distutils.core.Extension`
fr: Une liste d'instances de :class:`distutils.core.Extension'

source: A list of categories for the package
fr: Une liste de catégories pour le paquet

source: The list of available categorizations is at http://pypi.python.org/pypi?:action=list_classifiers.
fr: La liste des catégorisations est disponibles sur http://pypi.python.org/pypi?:action=list_classifiers.

source: the :class:`Distribution` class to use
fr: la classe :class:`Distribution` à utiliser

source: A subclass of :class:`distutils.core.Distribution`
fr: Une sous classe de :class:`distutils.core.Distribution`

source: Arguments to supply to the setup script
fr: Arguments à fournir au script d'installation

source: default options for the setup script
fr: options par défaut pour le script d'installation

source: The license for the package
fr: La licence pour le paquet

source: Descriptive meta-data, see :pep:`314`
fr: Méta-données descriptives, voir :pep:`314`

source: A mapping of command names to :class:`Command` subclasses
fr: Un mapping des noms de commandes et des sous-classes :class:`Command`

source: a dictionary
fr: un dictionnaire

source: A list of data files to install
fr: Une liste de fichiers de données à installer

source: a list
fr: une liste

source: A mapping of package to directory names
fr: Un mapping des paquets et des noms de dossiers

source: *script_name* is a file that will be read and run with :func:`exec`. ``sys.argv[0]`` will be replaced with *script* for the duration of the call. *script_args* is a list of strings; if supplied, ``sys.argv[1:]`` will be replaced by *script_args* for the duration of the call.
fr: *script_name* est un fichier qui sera lu et exécuté avec :func:`exec`. ``sys.argv[0]`` sera remplacé par *script* par la durée de l'appel. *script_args* est une liste de chaînes; si fourni, ``sys.argv[1:]`` sera remplacé par *script_args* pour la durée de l'appel.

source: *stop_after* tells :func:`setup` when to stop processing; possible values:
fr: *stop_after* dit à :func:`setup` quand s'arrêter; valeurs possibles:

source: Stop after the :class:`Distribution` instance has been created and populated with the keyword arguments to :func:`setup`
fr: S'arrête une fois que l'instance :class:`Distribution` a été créée et renseignée avec les arguments-clés de :func:`setup`

source: Stop after config files have been parsed (and their data stored in the :class:`Distribution` instance)
fr: S'arrête une fois que les fichiers de configuration ont été parcouru (et que leurs données ont été stockées dans l'instance :class:`Distribution`)

source: Stop after the command-line (``sys.argv[1:]`` or *script_args*) have been parsed (and the data stored in the :class:`Distribution` instance.)
fr: S'arrête une fois que la ligne de commande (``sys.argv[1:]`` ou *script_args*) a été parcouru (et les données stockées dans l'instance :class:`Distribution`)

source: Stop after all commands have been run (the same as if :func:`setup` had been called in the usual way). This is the default value.
fr: S'arrête une fois que toutes les commandes ont été exécutées (comme si :func:`setup` fût appelé de la manière habituelle). Ceci est la valeur par défaut.

source: In addition, the :mod:`distutils.core` module exposed a number of classes that live elsewhere.
fr: De plus, le module :mod:`distutils.core` a exposé un nombre de classe qui existent ailleurs.

source: :class:`Extension` from :mod:`distutils.extension`
fr: :class:`Extension` de :mod:`distutils.extension`

source: :class:`Command` from :mod:`distutils.cmd`
fr: :class:`Command` de :mod:`distutils.cmd`

source: :class:`Distribution` from :mod:`distutils.dist`
fr: :class:`Distribution` de :mod:`distutils.dist`

source: A short description of each of these follows, but see the relevant module for the full reference.
fr: Une courte description de chacune d'elle suit, mais consultez le module concerné pour une référence complète.

source: The Extension class describes a single C or C++extension module in a setup script. It accepts the following keyword arguments in its constructor
fr: La class Extension décrit un seul module d'extension C ou C++ dans un script d'installation. Elle accepte dans son constructeur les arguments-clés suivants

source: the full name of the extension, including any packages --- ie. *not* a filename or pathname, but Python dotted name
fr: le nom complet de l'extension, incluant n'importe quel paquet --- c-à-d *pas* un nom de fichier ou de chemin mais un nom Python séparé par des points

source: list of source filenames, relative to the distribution root (where the setup script lives), in Unix form (slash- separated) for portability. Source files may be C, C++, SWIG (.i), platform-specific resource files, or whatever else is recognized by the :command:`build_ext` command as source for a Python extension.
fr: listes des noms de fichier des sources, relatifs à la racine de la distribution (où est placé le script setup), dans un format Unix (séparé par des slashs) dans un souci de portabilité. Les fichiers de code source peuvent être du C, C++, SWIG (.i), des fichiers de ressources spécifiques à la plateforme ou tout autre reconnu par la commande :command:`build_ext` comme source d'une extension Python

source: list of directories to search for C/C++ header files (in Unix form for portability)
fr: liste des répertoires où chercher les fichiers d'entêtes C/C++ (en format Unix dans un souci de portabilité)

source: list of files that the extension depends on
fr: liste des fichiers dont dépend l'extension

source: extension language (i.e. ``'c'``, ``'c++'``, ``'objc'``). Will be detected from the source extensions if not provided.
fr: langage de l'extension (par exemple ``'c'``, ``'c++'``, ``'objc'``). Il sera détecté selon l'extension de la source s'il n'est pas précisé.

source: This module provides the following functions.
fr: Ce module fournit les fonctions suivantes.

source: Determine the default compiler to use for the given platform.
fr: Détermine le compilateur par défaut a utiliser par une plateforme donnée

source: The default values are ``os.name`` and ``sys.platform`` in case the parameters are not given.
fr: Les valeurs par défaut sont ``os.name`` et ``sys.platform`` si les paramètres ne sont pas fournis.
